###############################################################################
# Created by write_sdc
# Mon Oct  2 21:03:49 2023
###############################################################################
current_design user_proj_IMPACT_HEAD
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Bank_Select[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Bank_Select[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Byte_Select[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Byte_Select[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {PreCharge}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ReadEnable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Word_Select[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WriteEnable}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[32]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[33]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[34]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[35]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[36]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[37]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {user_irq[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {user_irq[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {user_irq[2]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {Data_Out[7]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[6]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[5]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[4]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[3]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[2]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[1]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[0]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[37]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[36]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[35]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[34]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[33]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[32]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[31]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[30]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[29]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[28]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[27]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[26]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[25]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[24]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[23]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[22]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[21]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[20]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[19]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[18]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[17]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[16]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[15]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[14]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[13]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[12]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[11]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[10]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[9]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[8]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[7]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[6]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[5]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[4]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[3]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[0]}]
set_load -pin_load 0.0334 [get_ports {user_irq[2]}]
set_load -pin_load 0.0334 [get_ports {user_irq[1]}]
set_load -pin_load 0.0334 [get_ports {user_irq[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {PreCharge}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ReadEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WriteEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Bank_Select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Bank_Select[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Byte_Select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Byte_Select[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Word_Select[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
